import { EventItem } from '../types/event';

export const initialEvents: EventItem[] = [
  {
    id: 'event-1',
    title: 'Зустріч IT-гуртка',
    date: '12.10, 14:00',
    place: 'Кабінет 305',
    category: 'Навчання',
    description:
      'Детальне обговорення нових трендів у розробці мобільних застосунків, огляд фреймворків React Native та Expo. Також будемо обирати цікаві теми для курсових проектів, розподіляти завдання у командах та розбирати складні питання архітектури.',
  },
  {
    id: 'event-2',
    title: 'Лекція з кібербезпеки',
    date: '15.10, 11:30',
    place: 'Актова зала',
    category: 'Навчання',
    description:
      'Відкрита лекція від запрошеного експерта про сучасні загрози в мережі, методи захисту персональних даних та запобігання фішинговим атакам. Студенти дізнаються про основи цифрової гігієни, налаштування двофакторної автентифікації та реальні кейси захисту корпоративних систем.',
  },
  {
    id: 'event-3',
    title: 'Благодійний осінній концерт',
    date: '18.10, 16:00',
    place: 'Актова зала',
    category: 'Культура',
    description:
      'Масштабний виступ студентських талантів, вокальних і танцювальних колективів нашого коледжу. Під час заходу проводитиметься ярмарок смаколиків та благодійний збір коштів на підтримку важливих соціальних та волонтерських ініціатив. Запрошуються всі бажаючі!',
  },
  {
    id: 'event-4',
    title: 'Турнір з настільного тенісу',
    date: '20.10, 15:00',
    place: 'Спортивна зала',
    category: 'Спорт',
    description:
      'Щорічні змагання серед студентів усіх курсів та спеціальностей. Захід включає груповий етап, фінальні матчі та урочисте нагородження. Переможці отримають пам’ятні кубки, медалі та цінні призи від спортивного клубу коледжу.',
  },
];


